In [1]:
import pandas as pd
import random

## Reading Data File

In [28]:
oil_price_df = pd.read_csv('Oil_Pricedata.csv')

In [29]:
oil_price_df['date'] = pd.to_datetime(oil_price_df['date'])

In [30]:
oil_price_df.head()

        date  price
0 2023-05-01    142
1 2023-05-02    173
2 2023-05-03     64
3 2023-05-04    166
4 2023-05-05    197

In [31]:
oil_price_df.shape

(58, 2)

In [32]:
min_date,max_date = oil_price_df['date'].min(),oil_price_df['date'].max()
min_date, max_date

(Timestamp('2023-05-01 00:00:00'), Timestamp('2023-06-30 00:00:00'))

## Creating a standard Dataframe with all the dates between give date range

In [19]:
dates = pd.DataFrame( pd.date_range(start='2023-05-01',end='2023-06-30',freq='D' ),columns=['dt'])

In [20]:
dates.head()

          dt
0 2023-05-01
1 2023-05-02
2 2023-05-03
3 2023-05-04
4 2023-05-05

In [21]:
dates.shape

(61, 1)

## Finding which all dates are missing in the original data

In [33]:
combined_df = pd.merge(dates,oil_price_df,left_on='dt',right_on='date',how='left')

In [34]:
combined_df.shape

(61, 3)

In [35]:
combined_df[combined_df['dt']!=combined_df['date']]

           dt date  price
11 2023-05-12  NaT    NaN
20 2023-05-21  NaT    NaN
25 2023-05-26  NaT    NaN

## Filling Missing Values

In [37]:
combined_df['price'].fillna(method='bfill',inplace=True)

In [38]:
combined_df[combined_df['dt']!=combined_df['date']]

           dt date  price
11 2023-05-12  NaT   77.0
20 2023-05-21  NaT  103.0
25 2023-05-26  NaT  130.0

In [39]:
combined_df.shape

(61, 3)

### Summary: So Finally one can use this combined_df dataframe where in "dt" column can be referenced as date column and "price" for the actual values